app/controllers/school_classes_controller.rb

  def create
    school_class = SchoolClass.create(post_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Welding"], ["room_number", 78]]

  def set_school_class
    SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]