app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "James"], ["last_name", "Sloat"], ["created_at", "2018-06-12 17:55:07.180822"], ["updated_at", "2018-06-12 17:55:07.180822"]]
---
  def create
    student = Student.create(post_params)

UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "O'Formerson"], ["updated_at", "2018-06-12 18:04:01.364708"], ["id", 4]]
---
  def update
    @student = set_student
    @student.update(post_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_student
    Student.find(params[:id])